app/views/comments/_comment.html.haml

INSERT INTO "comments" ("body", "author_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "You can add comments to this post"], ["author_id", 7], ["post_id", 102], ["created_at", "2019-07-01 20:30:04.891167"], ["updated_at", "2019-07-01 20:30:04.891167"]]
---
  %p#comment-body= comment.body
  %em= "#{time_ago_in_words(comment.created_at)} ago"