app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 102]]
INSERT INTO "comments" ("body", "author_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "You can add comments to this post"], ["author_id", 7], ["post_id", 102], ["created_at", "2019-07-01 20:30:04.891167"], ["updated_at", "2019-07-01 20:30:04.891167"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(comment_params)
    authorize @comment

    @comment.save