app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.paginate(page: params[:page], per_page: 10).order(created_at: :desc)

INSERT INTO "posts" ("title", "body", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "This is a test"], ["body", "This is a test post for my MVP!"], ["author_id", 7], ["created_at", "2019-07-01 19:48:09.051465"], ["updated_at", "2019-07-01 19:48:09.051465"]]
---
  def create
    @post = Post.new(post_params)
    authorize @post

    if @post.save